# GetFabricationConfigurationInfo Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetFabricationConfigurationInfo Method
FabricationConfiguration Class See Also
---
Gets the information about the fabrication configuration of the project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public FabricationConfigurationInfo GetFabricationConfigurationInfo()
```

Visual Basic
---
```text
Public Function GetFabricationConfigurationInfo As FabricationConfigurationInfo
```

Visual C++
---
```text
public:
FabricationConfigurationInfo^ GetFabricationConfigurationInfo()
```

# ### Return Value
The information about the fabrication configuration of the project.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace